Repository: cran/MCPtests
Catalog: po/R-*.po
Languages: pt_br

source: GUI to the MCP package
pt_br: IGU para o pacote MCP

source: Configurations of the data
pt_br: Configurações dos dados

source: Enter the data
pt_br: Insira os dados

source: The variables in the file:
pt_br: As variáveis no arquivo:

source: R object created: 'dat'
pt_br: Objeto R criado: 'dat'

source: Enter the data file (.txt or .csv)
pt_br: Entre com o conjunto de dados (.txt ou .csv)

source: Select a file ...
pt_br: Selecione um arquivo ...

source: Check the data has been loaded correctly. To do this, use the 'Edit/View' button or the 'Output' frame.
pt_br: Verifique se os dados foram carregados corretamente. Para isso, use o botão 'Edite/Visualize' ou o quadro 'Saída'.

source: No data set has been entered!
pt_br: Nenhum conjunto de dados foi inserido!

source: File
pt_br: Arquivo

source: Open file (.txt or .csv)...
pt_br: Abra o arquivo (.txt or .csv)...

source: Comma as decimal points
pt_br: Vírgula como separador decimal

source: Separator of variables:
pt_br: Separador de variáveis:

source: Edit
pt_br: Editar

source: Data set...
pt_br: Conjunto de dados...

source: Choose directory...
pt_br: Escolha o diretório...

source: To insert a data set, the possible extensions are '.txt' and '.csv'. To do this, use the 'browse' button. If you want to identify a directory, before clicking on the 'browse' button, click on the 'Choosing the directory' button. After entering the data set, if you want to edit or view, click on the 'Edit/View' button. If your data has a comma as a decimal point separator, before clicking on the 'browse' button, activate the 'Comma as decimal points' box. Finally, if the variable separator is different from a blank space, indicate it without quotes in the 'Separator of variables' box.
pt_br: Para inserir um conjunto de dados, as extensões possíveis são '.txt' e '.csv'. Para isso, use o botão 'browse'. Se quiser identificar um diretório, antes de clicar no botão 'browse', clique no botão 'Escolha um diretório'. Depois de entrar com o conjunto de dados, se quiser editar ou visualizar, clique no botão 'Edite/Visualize'. Se seus dados apresentam vírgula como separador decimal, antes de clicar no botão 'browse', ative a caixa 'Vírgula como separador decimal'. Finalmente, se o separador de variáveis é diferente de um espaço em branco, indique-o na caixa 'Separador de variáveis'.

source: Output:
pt_br: Saída

source: Calculate
pt_br: Calcular

source: Input
pt_br: Entrada

source: Tests:
pt_br: Testes:

source: Choose the test for data analysis. The Mean Grouping test based on Midrange (MGM test) and Mean Grouping test based on Range (MGR test) are tests without ambiguity in their results. These tests are similar to the Scott-Knott test. The Tukey Midrange test (TM test) and SNK Midrange test (SNKM test) are tests similar to the Tukey and SNK tests, respectively. these tests are also based on midrange.
pt_br: Escolha o teste para a análise de dados. O teste de agrumento de médias baseado na Midrange (teste MGM) e o teste de agrupamento de médias baseados na amplitude (teste MGR). Os testes Tukey Midrange (teste TM) e o teste SNK Midrange (teste SNKM) são similares aos testes Tukey e SNK, respectivamente. Esses testes também são baseados na midrange.

source: Extension:
pt_br: Extensão:

source: Choose the type of extension for the data output file. If 'latex', the code will be exported to the Console frame. The remaining options will be exported to the selected directory. The choice of the directory can be made in the 'Choosing the directory' button.
pt_br: Escolha o tipo de extensão para a saída dos resultados. Se 'latex', o código será exportado no quadro 'Console'. As opções restantes serão exportadas ao diretório selecionado. A escolha do diretório pode ser feita pelo botão 'Escolha o diretório'.

source: help
pt_br: Ajuda

source: Choose the type of data entry. If 'Model', enter the experimental model. If 'Response Variable', enter the object name of the responses and treatments variables and if 'Averages', enter the vector of means and treatments. For more details, use the help button on each option. The 'Averages' option is the only one that will not need to load a data set. Just enter the recommended options and then click the 'Calculate' button.
pt_br: Escolha um tipo de entrada de dados. Se 'Model', entre com o modelo experimental. Se 'Response Variable', entre com o nome do objeto das variáveis respostas e dos tratamentos. E se 'Averages', entre com o vetor de médias e de tratamentos. Para mais detalhes, use o botão 'Ajuda' em cada opção. A opção 'Médias' é a única opção que não é necessário carregar o conjunto de dados. Apenas entre com as opções recomendadas e clique no botão 'Calcular'.

source: Significance:
pt_br: Significância:

source: Enter the value of the significance level. This value is a number between 0 and 1.
pt_br: Entre com os valores do nível de significância. Esse valor é um número entre 0 e 1.

source: Model
pt_br: Modelo

source: Scale of Plot
pt_br: Escala do Gráfico

source: Enter model:
pt_br: Entre com o modelo:

source: Enter the experimental model of type Response Variable (RV) ~ Predictive Variables (PV). These variables are in the 'Output' frame, after entering the data set. For example, in a randomized block design, assuming the 'treat' object corresponding to the treatments, 'block' object corresponding to the blocks and 'resp' object corresponding to the variable response. So, you must enter the following expression: resp ~ trat + block.
pt_br: Entre com o modelo experimental do tipo Variável Resposta (VR) ~ Variáveis Preditivas (VP). Essas variáveis estão no quadro 'Saída', depois de entrar com o conjunto de dados. Por exemplo, em um delineamento em blocos casualizados, assumindo o objeto 'treat' correspondendo aos tratamentos, o objeto 'block' aos blocos e o objeto 'resp' correspondendo as variáveis respostas, podemos entrar com a seguinte expressão: resp ~ trat + block.

source: Treatment:
pt_br: Tratamento:

source: Enter label name...
pt_br: Entre com o nome do rótulo...

source: Enter the name of the treatments in the experiment model inserted above, in Predictive Variables (PV). The name of the treatment are in the 'Output' frame, after entering the data set. Inserted all the arguments above, click on the 'Calculate' button.
pt_br: Entre com o nome dos tratamentos no modelo experimental inserido acima, em variáveis preditivas. O nome do tratamento está no quadro 'Saída', depois de inserido o conjunto de dados. Inserido todos os argumentos acim, clique no botão 'Calcular'.

source: Response variable
pt_br: Variável resposta

source: Response:
pt_br: Resposta:

source: Insert the name of the variable response of the experiment model. The name of the response variable are in the 'Output' frame, after inserting the data set.
pt_br: Insira o nome da variáve resposta no modelo experimental. O nome da variável resposta está no quadro 'Saída', depois de inserido o conjunto de dados.

source: Enter the name of the treatment of the experiment model. The name of the response variable are in the 'Output' frame, after entering the data set.
pt_br: Entre com o nome do tratamento do modelo experimental. O nome da variável resposta está no quadro 'Saída', depois de inserido o conjunto de dados.

source: DFerror:
pt_br: GLE

source: Enter numeric value...
pt_br: Entre com o valor numérico...

source: Enter the numeric value of the degrees of freedom of the mean square error of the experiment model.
pt_br: Entre com o valor numérico dos dos graus de liberdade do quadrado médio do erro.

source: MSerror:
pt_br: QME

source: Enter the value of the mean square error of the experiment model. The value is numeric. Inserted all the arguments above, click on the 'Calculate' button.
pt_br: Entre com o valor do quadrado médio do erro do modelo experimental. O valor é numérico. Inserido todos os argumentos acim, clique no botão 'Calcular'.

source: Averages
pt_br: Médias

source: Averages:
pt_br: Médias:

source: Enter the vector...
pt_br: Entre com o vetor...

source: Enter the values of the averages. Each mean of the vector must be separated by a comma. For example, for the vector of the average of four treatments: 10, 20, 30, 40. You do not need to use the concatenate function, i.e., c().
pt_br: Entre com os valores das médias. Cada média do vetor de ve ser separado por uma vírgula. Por exemplo, para um vetor de médias de quatro tratamentos: 10, 20, 30, 40. Você não necessita usar a função concatenar do R, isto é, c().

source: Enter the treatment levels. For example, for a character vector of four treatments: A, B, C, D. You do not need to use the concatenate function, i.e., c(). Nor will you need to use quotes between treatment levels.
pt_br: Entre com os niveis dos tratamentos. Por exemplo, para um vetor de caractere de quatro tratamentos: A, B, C, D. Você não necessita usar a função concatenar, isto é, c(). Nor will you need to use quotes between treatment levels.

source: Enter the numeric value...
pt_br: Entre com o valor numérico...

source: Enter the value of the degrees of freedom of the mean square error of the experiment model. The value is numeric.
pt_br: Entre com o valor dos graus de liberdade do quadrado médio do erro do modelo experimental. O valor é numérico.

source: Enter the value of the mean square error of the experiment model. The value is numeric.
pt_br: Entre com o valor do quadrado médio do erro. O valor é numérico.

source: Replication:
pt_br: Repetição:

source: Enter the value of number of replications of the treatments. The value is numeric and if the data is unbalanced use the harmonic mean of the replications. Inserted all the arguments above, click on the 'Calculate' button
pt_br: Entre com o valor do número de repetições dos tratamentos. O valor é numérico e se os dados forem desbalanceados, use a média harmônica das repetições.

source: Graphic Parameters
pt_br: Parâmetros Gráficos

source: Plot
pt_br: Gráfico

source: Color:
pt_br: Cor:

source: or gray.colors() or...
pt_br: ou gray.colors() ou...

source: Enter the color name of the chart bars. Place quotation marks around the color names. For example, if you want the color red for the bars, use 'red'. For functions, quotation marks are not necessary, for example gray.colors() function.
pt_br: Entre com o nome da cor do gráfico de barras. Insira aspas em torno do nome da cor. Por exemplo, se escolher a cor vermelha use 'red'. Para funções, não será necessário aspas, como por exemplo a função gray.colors().

source: FALSE or TRUE...
pt_br: FALSE ou TRUE...

source: Choose horizontal or vertical bars (FALSE or TRUE).
pt_br: Se horizontal, use FALSE. Se vertical use TRUE.

source: Axes:
pt_br: Eixos:

source: Enter the axes. Separate them by semicolons. To add the names on the X and Y axes: xlab = 'Label X-axix'; ylab = 'Label Y-axis'.
pt_br: Entre com os eixos. Separe-os por ponto e vírgula (;). Para adicionar os nomes dos eixos X e E: xlab = 'Eixo X'; ylab = 'Eixo Y'.

source: Update plot
pt_br: Atualizar o gráfico

source: Save as...
pt_br: Salvar como...

source: Really close?
pt_br: Deseja fechar?

source: Use the MRtest function! For help, use ?MRtest.
pt_br: Use a função MRtest! Para ajuda, use ?MRtest.

source: Democratizing statistical knowledge to the world!
pt_br: Democratizando o conhecimento estatístico para o mundo!

source: Parallel
pt_br: Paralelo

source: Parallelization is still limited for some tests, such as the Scott-Knott's test. However, it is worth mentioning that it is not always efficient to use parallelization, especially when the data set is small.
pt_br: A paralelização ainda está limitada para alguns testes, tais como o teste Scott-Knott. Contudo, vale ressaltar que nem sempre é eficiente utilizar a paralelização, principalmente quando o conjunto de dados é pequeno.

source: The choice of the tests in the MCP argument must be in accordance with the tests chosen in the x argument Options:
pt_br: A escolha dos testes no argumento MCP deve está de acordo com os testes escolhidos no argumento x Opções:

source: The replication argument must be informed
pt_br: O argumento replication deve ser informado

source: The y argument must be numeric
pt_br: O argumento y deve ser numérico

source: The trt argument must be factor
pt_br: O argumento trt deve ser fator

source: The y and trt arguments must have same length
pt_br: Os argumentos y e trt devem ter mesmo comprimento

source: The dferror argument must be informed
pt_br: O argumento dferror deve ser informado

source: The mserror argument must be informed
pt_br: O argumento mserror deve ser informado

source: The trt argument is required
pt_br: O argumento trt é necessário

source: The options for the MCP argument are 'MGM', 'MGR', 'SNKM', 'TM' and 'SK'
pt_br: As opções para o argumento MCP são 'MGM', 'MGR', 'SNKM', 'TM' e 'SK'

source: The length of the trt argument is invalid
pt_br: O comprimento do argumento trt é inválido

source: The options for the trt argument are Options:
pt_br: As opções para o argumento trt são Opções:

source: Note: Observe which of the options have signified practice
pt_br: Nota: Observe quais das opções têm significado prático

source: Any of the options of trt argument is wrong Options:
pt_br: Alguma das opções do argumento trt está errado Opções:

source: The length of the extension argument is greater than 1.
pt_br: O comprimento do argumento extension é maior que 1.

source: Options:
pt_br: Opções:

source: Any dataMR argument is invalid Options:
pt_br: Algum das opções do argumento dataMR é inválido Opções:

source: groups
pt_br: grupos

source: summary
pt_br: Sumário

source: Any extension argument is invalid Options:
pt_br: Alguma das opções do argumento extension é inválido Opções:

source: Multiple Comparison Procedures
pt_br: Procedimentos de Comparações Múltiplas

source: Study:
pt_br: Estudo:

source: Unbalanced data: It will be used the harmonic mean of the number of experiment replicates
pt_br: Dados desbalanceados: Será usado a média harmônica do número de repetições do experimento

source: Summary:
pt_br: Sumário:

source: Harmonic mean of the number of experiment replicates
pt_br: Média harmônica do número de repetições do experimento

source: Statistics:
pt_br: Estatísticas:

source: Groups:
pt_br: Grupos:

source: Means Grouping Midrange Test (BATISTA, 2016)
pt_br: Teste de Agrupamento de Médias baseado na Midrange estudentizada (BATISTA, 2016)

source: Mean Grouping Range Test (BATISTA, 2016)
pt_br: Teste de Agrupamento de Médias baseado na amplitude estudentizada (BATISTA, 2016)

source: SNK Midrange Test (BATISTA, 2016)
pt_br: Teste SNK baseado na Midrange estudentizada (BATISTA, 2016)

source: Tukey Midrange Test (BATISTA, 2016)
pt_br: Teste Tukey baseado na Midrange estudentizada (BATISTA, 2016)

source: Scott-Knott's Test (SCOTT-KNOTT, 1974)
pt_br: Teste de Scott-Knott (SCOTT-KNOTT, 1974)

source: Table in latex of results of the MGM test
pt_br: Tabela em latex dos resultados do teste MGM

source: Table in latex of results of the MGR test
pt_br: Tabela em latex dos resultados do teste MGR

source: Table in latex of results of the SNKM test
pt_br: Tabela em latex dos resultados do teste SNKM

source: Table in latex of results of the TM test
pt_br: Tabela em latex dos resultados do teste TM

source: Table in latex of results of descriptive statistics
pt_br: Tabela em latex dos resultados das estatísticas descritivas

source: See yours tables in Console
pt_br: Veja suas tabelas no Console

source: Format:
pt_br: Formato:

source: See your files in Directory
pt_br: Veja seus arquivos no Diretório

source: Missing data entry!
pt_br: Falta entrada de dados!

source: Groups
pt_br: Grupos

source: Variance
pt_br: Variância

source: DF
pt_br: GL

source: Test
pt_br: Teste

source: P-value
pt_br: Valor-p

source: Means
pt_br: Médias

source: std
pt_br: Erro Padrão

source: Exp.Mean
pt_br: Média.Exp

source: MSerror
pt_br: QME

source: Stud.Midrange
pt_br: Midrange.Est

source: Ext.DMS
pt_br: DMS.Ext

source: Int.DMS
pt_br: DMS.Int

source: Details of results
pt_br: Detalhes dos resultados

source: Simple results
pt_br: Resultado simples

source: Stud.Range
pt_br: Amp.Est

source: The options for the parallel argument are TRUE or FALSE!
pt_br: As opções para o argumento parallel são TRUE ou FALSE!

source: Table in latex of results of the Scott-Knott's test
pt_br: Tabelas em latex dos resultados do teste Scott-Knott
